back/app/controllers/acessos_controller.rb

SELECT  "acessos".* FROM "acessos"  ORDER BY created_at DESC LIMIT 50
---
  def index
    @acesso = Acesso.order('created_at DESC').limit(50)

SELECT  "acessos".* FROM "acessos" WHERE "acessos"."id" = ? LIMIT 1  [["id", 1]]
---
  def show
    @acesso = Acesso.find(params[:id])

INSERT INTO "acessos" ("pagina", "contato_id", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["pagina", "Home"], ["contato_id", 1], ["created_at", "2016-04-06 13:26:02.365293"], ["updated_at", "2016-04-06 13:26:02.365293"]]
---
  def create
  if Contato.exists?(id: acesso_params[:contato_id])
     @acesso = Acesso.new(acesso_params)
    @acesso.save