back/app/controllers/contatos_controller.rb

  def index
    @contato = Contato.order('created_at DESC').limit(50)
---
SELECT  "contatos".* FROM "contatos"  ORDER BY created_at DESC LIMIT 50

  def show
    if Contato.exists?(id: params[:id])
      @contato = Contato.find(params[:id])
---
SELECT  "contatos".* FROM "contatos" WHERE "contatos"."id" = ? LIMIT 1  [["id", 1]]

  def create
    if Contato.exists?(email: contato_params[:email])
      @contato = Contato.find_by_email(contato_params[:email])
      render :json => { status: 'error', :error => 'contato já existente', :contato => @contato.as_json }
    else
      @contato = Contato.new(contato_params)
      @contato.save
---
SELECT  "contatos".* FROM "contatos" WHERE "contatos"."email" = ? LIMIT 1  [["email", "1234@1234.com.br"]]
SELECT  1 AS one FROM "contatos" WHERE "contatos"."email" = ? LIMIT 1  [["email", "teste2@teste.com.br"]]
INSERT INTO "contatos" ("nome", "email", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["nome", "Alexandre"], ["email", "alexandre@funciona.com.br"], ["created_at", "2016-04-06 01:12:21.832622"], ["updated_at", "2016-04-06 01:12:21.832622"]]